# How to group

In [15]:
import pandas as pd

In [16]:
dataTable = {

    'company' : ['Whipro', 'Whipro', 'Imfosys', 'Imfosys', 'PCS', 'PCS'],
    'employee' : ['Tanmoy', 'Subham', 'Pranjit', 'Supratim', 'Partha', 'Suraj'],
    'salary' : [35000, 36738, 43572, 16578, 2500, 546]
}

In [21]:
df = pd.DataFrame(dataTable)
df

   company  employee  salary
0   Whipro    Tanmoy   35000
1   Whipro    Subham   36738
2  Imfosys   Pranjit   43572
3  Imfosys  Supratim   16578
4      PCS    Partha    2500
5      PCS     Suraj     546

In [22]:
grouped_by_company = df.groupby('company')

In [23]:
grouped_by_company

In [27]:
grouped_by_company.sum()['salary']

company
Imfosys    60150
PCS         3046
Whipro     71738
Name: salary, dtype: int64

In [30]:
grouped_by_company.max()

         employee  salary
company
Imfosys  Supratim   43572
PCS         Suraj    2500
Whipro     Tanmoy   36738

In [31]:
grouped_by_company.count()

         employee  salary
company
Imfosys         2       2
PCS             2       2
Whipro          2       2

In [35]:
grouped_by_company.describe().transpose()

company            Imfosys         PCS        Whipro
salary count      2.000000     2.00000      2.000000
       mean   30075.000000  1523.00000  35869.000000
       std    19087.640451  1381.68665   1228.951586
       min    16578.000000   546.00000  35000.000000
       25%    23326.500000  1034.50000  35434.500000
       50%    30075.000000  1523.00000  35869.000000
       75%    36823.500000  2011.50000  36303.500000
       max    43572.000000  2500.00000  36738.000000

## Different types of operations in pandas dataframe

In [37]:
d = {
    'col1' : [10,20,30,40],
    'col2' : [333,222,333,444],
    'col3' : ['Tanmoy', 'Subham', 'Pranjit', 'Shayan']
}

df = pd.DataFrame(d)
df

   col1  col2     col3
0    10   333   Tanmoy
1    20   222   Subham
2    30   333  Pranjit
3    40   444   Shayan

In [40]:
df['col2'].unique() # output ta ekta numpy array

array([333, 222, 444])

In [42]:
len(list(df['col2'].unique()))

3

In [43]:
df['col2'].nunique()

3

In [45]:
df['col2'].value_counts()

col2
333    2
222    1
444    1
Name: count, dtype: int64

In [47]:
print(df)

   col1  col2     col3
0    10   333   Tanmoy
1    20   222   Subham
2    30   333  Pranjit
3    40   444   Shayan

In [48]:
df_1 = df[ (df['col1'] > 15) & ( df['col2'] == 333 ) ]

In [49]:
df_1

   col1  col2     col3
2    30   333  Pranjit

In [50]:
def find_cube(n):
    return n**3

df['col1'].apply(find_cube)

0     1000
1     8000
2    27000
3    64000
Name: col1, dtype: int64

In [51]:
name = 'hello'
print(len(name))

5

In [52]:
df['col3'].apply(len)

0    6
1    6
2    7
3    6
Name: col3, dtype: int64

In [54]:
df['col2'].sum()

1332

In [55]:
df

   col1  col2     col3
0    10   333   Tanmoy
1    20   222   Subham
2    30   333  Pranjit
3    40   444   Shayan

In [ ]:
del df['col1'] # for permanently deleting functions

In [59]:
df

   col2     col3
0   333   Tanmoy
1   222   Subham
2   333  Pranjit
3   444   Shayan

In [61]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [64]:
df.index # depreciated

RangeIndex(start=0, stop=4, step=1)

In [65]:
df

   col2     col3
0   333   Tanmoy
1   222   Subham
2   333  Pranjit
3   444   Shayan

In [75]:
df.sort_values(by = 'col2', ascending=True) # in ascending order, for descending 'ascending=False'

   col2     col3
1   222   Subham
0   333   Tanmoy
2   333  Pranjit
3   444   Shayan

In [76]:
df

   col2     col3
0   333   Tanmoy
1   222   Subham
2   333  Pranjit
3   444   Shayan

In [77]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [80]:
df.dropna() # null value will delete with row

   col2     col3
0   333   Tanmoy
1   222   Subham
2   333  Pranjit
3   444   Shayan

In [81]:
df.fillna('WHAT TO FILL')

   col2     col3
0   333   Tanmoy
1   222   Subham
2   333  Pranjit
3   444   Shayan